Revit 2027 API
BendingDetailCustomFieldProperties.AreEqualTo Method
 Identifies if the custom field properties are equal or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool AreEqualTo(
	ICustomFieldProperties otherProperties
)
Public Overridable Function AreEqualTo (
	otherProperties As ICustomFieldProperties
) As Boolean
public:
virtual bool AreEqualTo(
	ICustomFieldProperties^ otherProperties
)
abstract AreEqualTo :
        otherProperties : ICustomFieldProperties -> bool
override AreEqualTo :
        otherProperties : ICustomFieldProperties -> bool
Parameters
otherProperties ICustomFieldProperties
 The other properties.
Return Value
Boolean
 Returns true if the custom field properties are equal, false otherwise.
Implements
ICustomFieldProperties.AreEqualTo(ICustomFieldProperties)
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace